clojure.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>clojure</title>
<!-- 2015-01-30 Fri 22:59 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Toby Tripp" />
<link rel="stylesheet" href="https://maxcdn.bootstrapcdn.com/bootstrap/3.3.2/css/bootstrap.min.css">
<link rel="stylesheet" href="css/config.css">
<link rel="stylesheet" href="css/htmlize.css">
</head>
<body>
<div id="preamble" class="status">
<p><a accesskey="H" href="index.html">HOME</a></p>
</div>
<div id="content">
<h1 class="title">clojure</h1>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Clojure Customizations</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">Cider</h3>
<div class="outline-text-3" id="text-1-1">
<p>
This will pull in <code>clojure-mode</code> as well.
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #f5deb3;">(</span>require-package 'cider<span style="color: #f5deb3;">)</span>

<span style="color: #f5deb3;">(</span><span style="color: #859900; font-weight: bold;">defun</span> <span style="color: #268bd2;">toby/save-and-eval-buffer</span> <span style="color: #b58900;">()</span>
  <span style="color: #2aa198; font-style: italic;">"Save open buffers and send the current buffer to the active Cider session."</span>
  <span style="color: #b58900;">(</span>interactive<span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span>save-some-buffers 't<span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span>cider-eval-buffer<span style="color: #b58900;">)</span><span style="color: #f5deb3;">)</span>

<span style="color: #f5deb3;">(</span><span style="color: #859900; font-weight: bold;">eval-after-load</span> 'cider
  '<span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">progn</span>
     <span style="color: #268bd2;">(</span>define-key cider-mode-map <span style="color: #dc322f;">(</span>kbd <span style="color: #2aa198;">"C-x M-e"</span><span style="color: #dc322f;">)</span> 'repl/eval-and-print<span style="color: #268bd2;">)</span>
     <span style="color: #268bd2;">(</span>define-key cider-mode-map <span style="color: #dc322f;">(</span>kbd <span style="color: #2aa198;">"&lt;f3&gt;"</span><span style="color: #dc322f;">)</span>    'cider-eval-defun-at-point<span style="color: #268bd2;">)</span>
     <span style="color: #268bd2;">(</span>define-key cider-mode-map <span style="color: #dc322f;">(</span>kbd <span style="color: #2aa198;">"&lt;f5&gt;"</span><span style="color: #dc322f;">)</span>    'toby/save-and-eval-buffer<span style="color: #268bd2;">)</span>
     <span style="color: #268bd2;">(</span>define-key cider-mode-map <span style="color: #dc322f;">(</span>kbd <span style="color: #2aa198;">"C-c C-e"</span><span style="color: #dc322f;">)</span> 'cider-eval-print-last-sexp<span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #f5deb3;">)</span>

<span style="color: #f5deb3;">(</span>add-hook 'cider-interaction-mode-hook 'cider-turn-on-eldoc-mode<span style="color: #f5deb3;">)</span>

<span style="color: #f5deb3;">(</span>toby/defhook cider-mode-hook <span style="color: #b58900;">(</span>paredit-mode<span style="color: #b58900;">)</span><span style="color: #f5deb3;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2">Clojure</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Paredit is my bestest friend
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #f5deb3;">(</span><span style="color: #859900; font-weight: bold;">defun</span> <span style="color: #268bd2;">toby/clojure-init</span> <span style="color: #b58900;">()</span>
  <span style="color: #b58900;">(</span>paredit-mode 1<span style="color: #b58900;">)</span>

  <span style="color: #586e75;">;; </span><span style="color: #586e75;">Compojure Macros:</span>
  <span style="color: #b58900;">(</span>define-clojure-indent
    <span style="color: #268bd2;">(</span>defroutes 'defun<span style="color: #268bd2;">)</span>
    <span style="color: #268bd2;">(</span>GET 2<span style="color: #268bd2;">)</span>
    <span style="color: #268bd2;">(</span>POST 2<span style="color: #268bd2;">)</span>
    <span style="color: #268bd2;">(</span>PUT 2<span style="color: #268bd2;">)</span>
    <span style="color: #268bd2;">(</span>DELETE 2<span style="color: #268bd2;">)</span>
    <span style="color: #268bd2;">(</span>HEAD 2<span style="color: #268bd2;">)</span>
    <span style="color: #268bd2;">(</span>ANY 2<span style="color: #268bd2;">)</span>
    <span style="color: #268bd2;">(</span>context 2<span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #f5deb3;">)</span>

<span style="color: #f5deb3;">(</span>add-hook 'clojure-mode-hook 'toby/clojure-init<span style="color: #f5deb3;">)</span>
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Toby Tripp</p>
<p class="date">Created: 2015-01-30 Fri 22:59</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.3.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
